app/Controllers/CategoriaController.php

    public function store()
    {
        $data = [
            'nombre'        => $this->request->getPost('nombre'),
            'descripcion'   => $this->request->getPost('descripcion'),
            'status'        => $this->request->getPost('status  ')
        ];

        $this->categoriaModel->insert($data);
---
INSERT INTO `categorias` (`nombre`, `descripcion`, `status`, `created_at`, `updated_at`) VALUES ('Entretenimiento', 'Pantalla SONY 54 Pulgadas', NULL, '2023-12-10 23:24:29', '2023-12-10 23:24:29')